w = float(input("โปรดบอกน้ำหนักตัวของคุณ : "))
   
h = float(input("โปรดบอกความสูงของคุณ : "))

h1  = h / 100
b = w / (h1 * h1)

print("ดัชนีมวลกายของคุณคือ : {:.2f}".format(b))

if(b >30):
    print("อยู่ในเกณฑ์ : อ้วนมาก / โรคอ้วนระดับ3\nภาวะเสี่ยงต่อโรค : อันตรายระดับ 3")
elif(b >= 25 and MBI <=29.90):
    print("อยู่ในเกณฑ์ : อ้วน / โรคอ้วนระดับ2\nภาวะเสี่ยงต่อโรค : อันตรายระดับ 2")
elif(b >= 23 and MBI <=24.90):    
    print("อยู่ในเกณฑ์ : ท้วม / โรคอ้วนระดับ1\nภาวะเสี่ยงต่อโรค : อันตรายระดับ 1")
elif(b >= 18.50 and MBI <=22.90):
    print("อยู่ในเกณฑ์ : ปกติ (สุขภาพดี)\nภาวะเสี่ยงต่อโรค : เท่าคนปกติ")
else:
    print("อยู่ในเกณฑ์ : น้ำหนักน้อย / ผอม\nภาวะเสี่ยงต่อโรค : มากกว่าคนปกติ")